### Terraform Plan for Production 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.app.aws_route53_record.stage_ns[0] will be created
  + resource "aws_route53_record" "stage_ns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "stage.design.vy.no"
      + records         = [
          + "ns-1366.awsdns-42.org",
          + "ns-160.awsdns-20.com",
          + "ns-1704.awsdns-21.co.uk",
          + "ns-733.awsdns-27.net",
        ]
      + ttl             = 3600
      + type            = "NS"
      + zone_id         = "Z0550583M01DE8DBF90V"
    }

  # module.app.aws_route53_record.test_ns[0] will be created
  + resource "aws_route53_record" "test_ns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "test.design.vy.no"
      + records         = [
          + "ns-1352.awsdns-41.org",
          + "ns-1668.awsdns-16.co.uk",
          + "ns-484.awsdns-60.com",
          + "ns-895.awsdns-47.net",
        ]
      + ttl             = 3600
      + type            = "NS"
      + zone_id         = "Z0550583M01DE8DBF90V"
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate.cloudfront must be replaced
+/- resource "aws_acm_certificate" "cloudfront" {
      ~ arn                       = "arn:aws:acm:us-east-1:471112960535:certificate/0f7a85c9-b065-4bb6-9c5c-4cd7e399a077" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "designmanual.vylabs.io"
              - resource_record_name  = "_dacd08540b3a23ceea12226455044b4b.designmanual.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_fce5bc5fe0b2411e03299189b8fd2e48.xlfgrmvvlj.acm-validations.aws."
            },
          + {
              + domain_name           = "design.vy.no"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "designmanual.vylabs.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:471112960535:certificate/0f7a85c9-b065-4bb6-9c5c-4cd7e399a077" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-11-11T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-10-13T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "design.vy.no",
            # (1 unchanged element hidden)
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate_validation.cloudfront must be replaced
-/+ resource "aws_acm_certificate_validation" "cloudfront" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:471112960535:certificate/0f7a85c9-b065-4bb6-9c5c-4cd7e399a077" -> (known after apply) # forces replacement
      ~ id                      = "2025-10-13 14:20:02.063 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_dacd08540b3a23ceea12226455044b4b.designmanual.vylabs.io",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.app.module.cloudfront_ssr.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                         = [
          + "design.vy.no",
            # (1 unchanged element hidden)
        ]
        id                              = "EHYA78XPGRC5E"
        tags                            = {}
        # (23 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:471112960535:certificate/0f7a85c9-b065-4bb6-9c5c-4cd7e399a077" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["design.vy.no"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z01363377N2BQ5L9TLHN"
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["designmanual.vylabs.io"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn                             = "_dacd08540b3a23ceea12226455044b4b.designmanual.vylabs.io" -> (known after apply)
      ~ id                               = "Z01363377N2BQ5L9TLHN__dacd08540b3a23ceea12226455044b4b.designmanual.vylabs.io._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_dacd08540b3a23ceea12226455044b4b.designmanual.vylabs.io" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_fce5bc5fe0b2411e03299189b8fd2e48.xlfgrmvvlj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cloudfront_alias["design.vy.no"] will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "design.vy.no"
      + type            = "A"
      + zone_id         = "Z01363377N2BQ5L9TLHN"

      + alias {
          + evaluate_target_health = false
          + name                   = "d2bfwfhr36x45f.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.replacement["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "replacement" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:471112960535:listener-rule/app/common-services-alb-alb/4288c7641cffe29b/a2e03d4ac8515160/22ba178235024184"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "designmanual.vylabs.io",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "design.vy.no",
                  + "designmanual.vylabs.io",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.service["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "service" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:471112960535:listener-rule/app/common-services-alb-alb/4288c7641cffe29b/ecf1dac238a8f4a6/0d0b9d0888706226"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "designmanual.vylabs.io",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "design.vy.no",
                  + "designmanual.vylabs.io",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 3 to change, 3 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 625951d69633d27d99d0c3ca5032363948d4c292*
*Plan generated at: 2025-10-20 14:17:05 UTC*
